app/controllers/list_controller.rb

SELECT DISTINCT "idols"."productionorunit" FROM "idols" WHERE (mediafromP = 'Love Live!')  ORDER BY "idols"."productionorunit" ASC
SELECT DISTINCT "idols"."mediafromP" FROM "idols"  ORDER BY "idols"."mediafromP" ASC
SELECT DISTINCT "idols"."h" FROM "idols"
SELECT DISTINCT "idols"."productionorunit2" FROM "idols" WHERE (mediafromP = 'Love Live!')  ORDER BY "idols"."productionorunit2" ASC
---
  def search

     @idols = Idol.all.order(nameko: :asc)

     #신장
     @heightMinRangeArray = rangeArray('height', 5, 0)
     @heightMaxRangeArray = rangeArray('height', 5, 1)
     #체중
     @weightMinRangeArray = rangeArray('weight', 5, 0)
     @weightMaxRangeArray = rangeArray('weight', 5, 1)
     #b
     @bMinRangeArray = rangeArray('b', 5, 0)
     @bMaxRangeArray = rangeArray('b', 5, 1)
     #w
     @wMinRangeArray = rangeArray('w', 5, 0)
     @wMaxRangeArray = rangeArray('w', 5, 1)
     #h
     @hMinRangeArray = rangeArray('h', 5, 0)
     @hMaxRangeArray = rangeArray('h', 5, 1)
     #소속사
     @productionorunit = Idol.select(:productionorunit).distinct.order(productionorunit: :asc)
     #hairstyle
     @hairstyle = nonRangeArray('hairstyle', 0)
     @hairstyle2 = (nonRangeArray('hairstyle2', 0) + nonRangeArray('hairstyle3', 0)).uniq
     @hairstyle3 = @hairstyle2
     #feature
     @feature = (nonRangeArray('feature', 0) + nonRangeArray('feature2', 0) + nonRangeArray('feature3', 0)).uniq
     #소속사2
     @mediafromp = Idol.select(:mediafromp).distinct.order(mediafromp: :asc).pluck(:mediafromp)
     @mediafromp_1 = {}
     @mediafromp.each do |v|
       one = Idol.where('mediafromp = ?', v).select(:productionorunit).distinct.order(productionorunit: :asc).pluck(:productionorunit)
       two = Idol.where('mediafromp = ?', v).select(:productionorunit2).distinct.order(productionorunit2: :asc).pluck(:productionorunit2)

SELECT DISTINCT "idols".* FROM "idols" WHERE (age >= 0) AND (height >= 0) AND (height >= '0' AND height < '190' OR height < 0) AND (weight >= '0' AND weight < '65' OR weight < 0) AND (b >= 0 AND w >= 0 AND h >= 0) AND (b >= '0' AND b < '110' OR b < 0) AND (w >= '0' AND w < '70' OR w < 0) AND (h >= '0' AND h < '95' OR h < 0) AND (NOT (productionorunit = '765PRO ALLSTARS' OR productionorunit2 = '765PRO ALLSTARS')) AND (NOT (productionorunit = 'μ''s' OR productionorunit2 = 'μ''s')) AND (NOT (productionorunit = 'A-RISE' OR productionorunit2 = 'A-RISE')) AND (NOT (productionorunit = '346 프로덕션' OR productionorunit2 = '346 프로덕션')) AND (NOT (productionorunit = '765 MILLIONSTARS' OR productionorunit2 = '765 MILLIONSTARS')) AND (NOT (productionorunit = '876 프로덕션' OR productionorunit2 = '876 프로덕션')) AND (NOT (productionorunit = '315 프로덕션' OR productionorunit2 = '315 프로덕션')) AND (NOT (productionorunit = 'Aqours' OR productionorunit2 = 'Aqours'))  ORDER BY "idols"."nameko" ASC
---
  def result

    @idols = Idol.all.order(nameko: :asc).distinct